---
kind: other
id: AllMembers.T:Autodesk.Revit.UI.PulldownButton
source: html/07936c55-8e72-eda4-6a6f-a66aae63d114.htm
---
# PulldownButton Members

Adds a new pushbutton to the pulldown button and associates it with an ExternalCommand.